; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)
(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)  
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
        (increase (total-cost) (fly-cost ?location_from ?location_to))  
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l9_p9_c9_g9_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 223)
	(= (fly-cost depot loc2) 68)
	(= (fly-cost depot loc3) 182)
	(= (fly-cost depot loc4) 131)
	(= (fly-cost depot loc5) 154)
	(= (fly-cost depot loc6) 161)
	(= (fly-cost depot loc7) 135)
	(= (fly-cost depot loc8) 82)
	(= (fly-cost depot loc9) 196)
	(= (fly-cost loc1 depot) 223)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 189)
	(= (fly-cost loc1 loc3) 67)
	(= (fly-cost loc1 loc4) 96)
	(= (fly-cost loc1 loc5) 74)
	(= (fly-cost loc1 loc6) 69)
	(= (fly-cost loc1 loc7) 98)
	(= (fly-cost loc1 loc8) 142)
	(= (fly-cost loc1 loc9) 84)
	(= (fly-cost loc2 depot) 68)
	(= (fly-cost loc2 loc1) 189)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 134)
	(= (fly-cost loc2 loc4) 94)
	(= (fly-cost loc2 loc5) 115)
	(= (fly-cost loc2 loc6) 140)
	(= (fly-cost loc2 loc7) 123)
	(= (fly-cost loc2 loc8) 70)
	(= (fly-cost loc2 loc9) 188)
	(= (fly-cost loc3 depot) 182)
	(= (fly-cost loc3 loc1) 67)
	(= (fly-cost loc3 loc2) 134)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 55)
	(= (fly-cost loc3 loc5) 34)
	(= (fly-cost loc3 loc6) 72)
	(= (fly-cost loc3 loc7) 90)
	(= (fly-cost loc3 loc8) 107)
	(= (fly-cost loc3 loc9) 119)
	(= (fly-cost loc4 depot) 131)
	(= (fly-cost loc4 loc1) 96)
	(= (fly-cost loc4 loc2) 94)
	(= (fly-cost loc4 loc3) 55)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 24)
	(= (fly-cost loc4 loc6) 51)
	(= (fly-cost loc4 loc7) 50)
	(= (fly-cost loc4 loc8) 53)
	(= (fly-cost loc4 loc9) 105)
	(= (fly-cost loc5 depot) 154)
	(= (fly-cost loc5 loc1) 74)
	(= (fly-cost loc5 loc2) 115)
	(= (fly-cost loc5 loc3) 34)
	(= (fly-cost loc5 loc4) 24)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 46)
	(= (fly-cost loc5 loc7) 57)
	(= (fly-cost loc5 loc8) 76)
	(= (fly-cost loc5 loc9) 98)
	(= (fly-cost loc6 depot) 161)
	(= (fly-cost loc6 loc1) 69)
	(= (fly-cost loc6 loc2) 140)
	(= (fly-cost loc6 loc3) 72)
	(= (fly-cost loc6 loc4) 51)
	(= (fly-cost loc6 loc5) 46)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 29)
	(= (fly-cost loc6 loc8) 80)
	(= (fly-cost loc6 loc9) 54)
	(= (fly-cost loc7 depot) 135)
	(= (fly-cost loc7 loc1) 98)
	(= (fly-cost loc7 loc2) 123)
	(= (fly-cost loc7 loc3) 90)
	(= (fly-cost loc7 loc4) 50)
	(= (fly-cost loc7 loc5) 57)
	(= (fly-cost loc7 loc6) 29)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 58)
	(= (fly-cost loc7 loc9) 65)
	(= (fly-cost loc8 depot) 82)
	(= (fly-cost loc8 loc1) 142)
	(= (fly-cost loc8 loc2) 70)
	(= (fly-cost loc8 loc3) 107)
	(= (fly-cost loc8 loc4) 53)
	(= (fly-cost loc8 loc5) 76)
	(= (fly-cost loc8 loc6) 80)
	(= (fly-cost loc8 loc7) 58)
	(= (fly-cost loc8 loc8) 1)
	(= (fly-cost loc8 loc9) 122)
	(= (fly-cost loc9 depot) 196)
	(= (fly-cost loc9 loc1) 84)
	(= (fly-cost loc9 loc2) 188)
	(= (fly-cost loc9 loc3) 119)
	(= (fly-cost loc9 loc4) 105)
	(= (fly-cost loc9 loc5) 98)
	(= (fly-cost loc9 loc6) 54)
	(= (fly-cost loc9 loc7) 65)
	(= (fly-cost loc9 loc8) 122)
	(= (fly-cost loc9 loc9) 1)
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(carrier-at carrier1 depot)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(person-at person1 loc9)
	(person-at person2 loc5)
	(person-at person3 loc8)
	(person-at person4 loc2)
	(person-at person5 loc7)
	(person-at person6 loc6)
	(person-at person7 loc4)
	(person-at person8 loc5)
	(person-at person9 loc3)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person6 medicine)
	(has-content-person person8 food)
	(has-content-person person9 food)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate9 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate9 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate9 carrier1)
   goals met: 1 of 10
2. (put-crate-in-carrier crate7 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate7 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   goals met: 1 of 10
3. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 0 of 10
4. (pick-and-drop crate7 loc9 drone1 carrier1 person1 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person1 food)
   goals met: 1 of 10
5. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 10
6. (put-crate-in-carrier crate6 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate6 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   goals met: 2 of 10
7. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 1 of 10
8. (pick-and-drop crate6 loc2 drone1 carrier1 person4 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate6 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person4 food)
   goals met: 2 of 10
9. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 10
10. (put-crate-in-carrier crate5 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   goals met: 3 of 10
11. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 2 of 10
12. (pick-and-drop crate5 loc7 drone1 carrier1 person5 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person5 food)
   goals met: 3 of 10
13. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 10
14. (put-crate-in-carrier crate4 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   goals met: 4 of 10
15. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 3 of 10
16. (pick-and-drop crate4 loc3 drone1 carrier1 person9 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person9 food)
   goals met: 4 of 10
17. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 10
18. (put-crate-in-carrier crate3 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   goals met: 5 of 10
19. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 4 of 10
20. (pick-and-drop crate3 loc6 drone1 carrier1 person6 food n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person6 food)
   goals met: 5 of 10
21. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 10
22. (put-crate-in-carrier crate2 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate2 carrier1)
   goals met: 6 of 10
23. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 5 of 10
24. (pick-and-drop crate9 loc6 drone1 carrier1 person6 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate9 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person6 medicine)
   goals met: 6 of 10
25. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 10
26. (put-crate-in-carrier crate8 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate8 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   goals met: 7 of 10
27. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 6 of 10
28. (pick-and-drop crate8 loc5 drone1 carrier1 person2 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person2 medicine)
   goals met: 7 of 10
29. (pick-and-drop crate2 loc5 drone1 carrier1 person2 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person2 food)
   goals met: 8 of 10
30. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 10
31. (put-crate-in-carrier crate1 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   goals met: 9 of 10
32. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 8 of 10
33. (pick-and-drop crate1 loc5 drone1 carrier1 person8 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person8 food)
   goals met: 9 of 10
34. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 10
